/*****************************************
 * Логирование текстов отправляемых СМС  *
 * Приложение: UPC-2                     *
 * Добавлен в версии: 2.68               *
 *****************************************/

/**
 * Инструментируемый класс (FQ-name)
 */
//droplet class: sms.SMSSenderImpl

/**
 * Инструментируемый метод
 */
//droplet method: sendMessage

/**
 * Точка вкрапления (одна из: BEFORE, INSTEAD, AFTER)
 */
//droplet cutpoint: BEFORE

/**
 * Текст вкрапления (адаптированный Java-код)
 */
//droplet text:
log.warn("Текст отправляемой SMS: '{}'", $2);