/*****************************************
 * Имитация отсутствия конечных статусов *
 *    у адресных денежных переводов      *
 * Приложение: UPC-2                     *
 * Добавлен в версии: 2.68               *
 * Добавлен по задаче: UPCSEC-2700       *
 *****************************************/

/**
 * Точка вкрапления (одна из: BEFORE, INSTEAD, AFTER)
 */
//droplet cutpoint: INSTEAD

/**
 * Инструментируемый метод
 */
//droplet method: isFinite

/**
 * Инструментируемый класс (FQ-name)
 */
//droplet class: models.TransferStatus

/**
 * Текст вкрапления (адаптированный Java-код)
 */
//droplet text:
return false;